/* Задана послідовність з n цілих чисел, серед яких є і від’ємні, а також натуральні числа р та q.
Знайти максимальний елемент послідовності і замінити його квадратом всі її елементи, модуль яких при діленні
на р дає у залишку q. */

#include "pch.h"
#include <iostream>
#include <iomanip>
#include<math.h>
using namespace std;


int main()
{
	setlocale(LC_ALL, "rus");
	int p = 4, q = 1, arr[10]{ 1,-2,-3,-4,-5,4,25,-7,-8,-9 }; //задаем массив
	cout << "Массив 10 элементов: " << endl; //вывод массива на экран
	for (int i = 0; i < 10; i++)
	{
		cout << arr[i] << " ";
	}


	int max = arr[0]; // поиск максимального элемента массива

	for (int i = 0; i < 10; ++i)
	{
		if (arr[i] > max)
		{
			max = arr[i];
		}
	}

	cout << "Максимальный элемент массива: " << max << endl; //вывод максимального элемента массива на экран


	for (int i = 0; i < 10; i++) //замена всех элементов, модуль которых при делении на p дает в остатке q на квадрат max
	{
		if (abs(arr[i]) % p == q)
			arr[i] = max * max;
	
		cout << arr[i] << " ";
	}
}
